# BlendEndParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BlendEndParam Property
ParameterTypeId Class See Also
---
"Second End"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BlendEndParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BlendEndParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BlendEndParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace